To use gnuplot, put your data in a file that looks like 
<a href="example-data"> this</a> 
<p>
and then type the following command to get gnuplot to
plot it on your terminal:
<p>
gnuplot>plot "example-data"
<p>
where example-data is the name of your data file.  single or double quotes both work.
<p>
The following sequence of commands will output that plot to a
postscript file (myplot.ps, in this example) instead of your terminal:
<p>
gnuplot>set term postscript
<p>
('set term postscript enhanced color' also works here)
<p>
gnuplot>set output "myplot.ps"
<p>
('set term pdf' also works here)
<p>
gnuplot>plot "example-data"
<p>
You can then send the postscript file to a printer or cut'n'paste it into
another document.
<p>
If your datafile has a bunch of columns, like <a
href="multicolumn-data"> this</a>, you can tell gnuplot which ones to
plot using 'using':
<p>
gnuplot> plot 'multicolumn-data' using 0:1
<p>
The default point shape is a little diamond.  If you want smaller dots,
use the "with dots" option:
<p>
gnuplot>plot "example-data" with dots
<p>
The "with lines" option lets you draw lines between successive points
in the data file.  (Don't use this option for CSCI 4446/5446!)  If you
are using this option but DON'T want lines drawn between some pair of
successive points, you have to leave a blank line between those points
in the data file.  See <a href="example-lines-data"> this</a> file
for an example.
<p>

There are a lot more options and bells and whistles to gnuplot; it can
plot in 3D, rotate stuff, etc.  Below is an example contributed by
Michael W.; it shows you how to change the point size, add titles and
label axes, use png format instead of ps, etc.  # is the comment
character.
<p>

gnuplot> set pointsize 0.2         # make small dots
<p>
gnuplot> set time             # add timestamp
<p>
gnuplot> set title "Fixed Point for Time Series Plot of x(n+1) = Rx(n) (1 -
x(n))"                           # add title
<p>
gnuplot> set xlabel "n"            # add x-label
<p>
gnuplot> set ylabel "xn"           # add y-label
<p>
gnuplot> set nokey            # don't put filename "fixed_point.txt" in
graph
<p>
gnuplot> plot "fixed_point.txt"          # plot data points
<p>
gnuplot> set terminal png          # tell gnuplot to make png image
<p>
gnuplot> set output "fixed_point.png"    # set png file
<p>
gnuplot> replot                    # plot to png file
<p>
gnuplot> quit
<p>
Please explore the help docs or the man pages if you want to learn
more.

<p> If you want to plot different things in different colors, here's
an example:
<p>
plot "file1" title "caption for file 1" with points pt 1, 
"file2" title "caption for file 2" with points pt 2
<p>
pt means point type.  If you type in test in gnuplot, it will show you
the various point types (with different colors).  Beware, because this
is not how the point types turn out if you are using postscript.  You
can also use "with lines" instead of "with points" and there is a
corresponding linetype (either ls or lt I think).  
